Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t
Serialization structure for shape and shape Enumerator

Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.MoreShapesLeft


Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.IndexToStart


Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.nShapes
Number of the shapes in the enumerator.

Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.aData
Shape enumerator data

Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.ClientId


Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.MaxChunkSize
Maximum amount of Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t that fit into Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t.aData